Dlubal.RFEM5.AreaLoad
Area load generator parameters.

Dlubal.RFEM5.AreaLoad.LoadCaseNo
Load case number

Dlubal.RFEM5.AreaLoad.Direction
Area load direction

Dlubal.RFEM5.AreaLoad.MemberLoadDirection
Member load direction

Dlubal.RFEM5.AreaLoad.Application
Area of load application.

Dlubal.RFEM5.AreaLoad.DistributionType
Load distribution type

Dlubal.RFEM5.AreaLoad.Distribution
Area load distribution

Dlubal.RFEM5.AreaLoad.Node1No
Load at the first node

Dlubal.RFEM5.AreaLoad.Magnitude1
Magnitude at the first node

Dlubal.RFEM5.AreaLoad.Node2No
Load at the second node

Dlubal.RFEM5.AreaLoad.Magnitude2
Magnitude at the second node

Dlubal.RFEM5.AreaLoad.Node3No
Load at the third node

Dlubal.RFEM5.AreaLoad.Magnitude3
Magnitude at the third node

Dlubal.RFEM5.AreaLoad.LoadArray
Array of loads

Dlubal.RFEM5.AreaLoad.CornerNodes
Corner nodes of the area load plane.

Dlubal.RFEM5.AreaLoad.InfluenceSingle
Remove influence from single members.

Dlubal.RFEM5.AreaLoad.InfluenceParallel
Remove influence from members parallel to members.